"""
Завдання 6: Калькулятор з використанням замикань
Створити калькулятор, який використовує замикання для створення функцій додавання, віднімання, множення та ділення.
1.	Написати функцію create_calculator, яка приймає оператор (наприклад, '+', '-', '*', '/')
та повертає функцію для виконання обчислень.
2.	Використати цю функцію, щоб створити калькулятор для кількох операцій, і протестувати його.
"""


# Функція для створення калькулятора
def create_calculator(operator):
    # Вкладена функція для виконання операції
    def calculate(a, b):
        operations = {'+': a + b, '-': a - b, '*': a * b, '/': a / b if b != 0 else "Помилка: ділення на нуль!"}
        return operations.get(operator, f"Невідомий оператор -> {operator}")

    # Повертаємо вкладену функцію (замикання)
    return calculate


print(create_calculator("+")(10, 5))
print(create_calculator("-")(10, 5))
print(create_calculator("*")(10, 5))
print(create_calculator("/")(10, 5))
print(create_calculator("/")(10, 0))
print(create_calculator("#")(10, 5))
