"""
Модуль для відображення меню
"""


def print_menu() -> None:
    """
    Виводить головне меню програми
    """
    print("\nМеню:")
    print("1. Додати, редагувати або видалити фільм")
    print("2. Додати, редагувати або видалити актора")
    print("3. Показати всі фільми з акторами")
    print("4. Показати унікальні жанри")
    print("5. Показати кількість фільмів за жанром")
    print("6. Показати середній рік народження акторів у фільмах певного жанру")
    print("7. Пошук фільму за назвою")
    print("8. Показати фільми (з пагінацією)")
    print("9. Показати імена всіх акторів та назви всіх фільмів")
    print("10. Скільки років минуло з моменту виходу кожного фільму")
    print("0. Вихід")


def print_edit_movie_menu() -> None:
    """
    Виводить меню редагування фільму
    """
    print("\nРедагувати фільм:")
    print("1. Змінити назву фільму")
    print("2. Змінити рік випуску")
    print("3. Змінити жанр")
    print("4. Видалити фільм")
    print("0. Повернутися до основного меню")


def print_add_actors_to_movie_menu() -> None:
    """
    Виводить меню для додавання акторів до фільму
    """
    print("\nДодати акторів до фільму:")
    print("1. Вибрати актора з існуючих")
    print("2. Додати нового актора")
    print("0. Вихід")


def print_edit_actor_menu() -> None:
    """
    Виводить меню редагування актора
    """
    print("\nРедагувати актора:")
    print("1. Змінити ім'я актора")
    print("2. Змінити рік народження актора")
    print("3. Прив'язати актора до фільму")
    print("4. Переглянути фільми, до яких прив'язаний актор")
    print("5. Видалити актора та прибрати всі прив'язки")
    print("0. Повернутися до основного меню")
