"""
Завдання 1: Створення власного пакета
Створи Python-пакет із наступною структурою:
my_package/
├── __init__.py
├── math_utils.py
├── string_utils.py
└── main.py
Реалізуй у файлі math_utils.py функцію, яка обчислює факторіал числа,
а також функцію для знаходження найбільшого спільного дільника двох чисел.
У файлі string_utils.py реалізуй функції для:
Перетворення тексту в верхній регістр.
Видалення пробілів на початку та в кінці рядка.
3. У файлі main.py імпортуй функції з модулів і продемонструй їх роботу, викликавши кожну з функцій.
"""
