import math


def factorial(n):
    """
    Обчислення факторіала числа n
    :param n: Ціле число, для якого обчислюється факторіал. Має бути додатним або нулем
    :return: Факторіал числа n
    :raises ValueError: Якщо n є від'ємним числом
    """
    if n < 0:
        raise ValueError("Факторіал визначений лише для додатних цілих чисел!")
    return math.factorial(n)


def gcd(a, b):
    """
    Знаходження найбільшого спільного дільника (НСД) двох чисел
    :param a: Перше ціле число
    :param b: Друге ціле число
    :return: НСД чисел a і b
    """
    while b:
        # Алгоритм Евкліда для знаходження НСД
        a, b = b, a % b
    return a
